/* automatically generated by rust-bindgen 0.71.1 */

pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const NULL: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 1;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub const R_ACCESS: u32 = 0;
pub const W_ACCESS: u32 = 1;
pub const RW_ACCESS: u32 = 2;
pub const RWE_ACCESS: u32 = 3;
pub type va_list = *mut ::std::os::raw::c_char;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __vcrt_va_list_is_reference {
    pub _address: u8,
}
pub const __vcrt_va_list_is_reference___the_value: __vcrt_va_list_is_reference__bindgen_ty_1 =
    false;
pub type __vcrt_va_list_is_reference__bindgen_ty_1 = bool;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __vcrt_assert_va_start_is_not_reference {
    pub _address: u8,
}
pub type __vcrt_bool = bool;
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
#[doc = " \\struct  bankSector.\n \\brief   This stucture indicates the sectors parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bankSector {
    #[doc = "< Index of the sector."]
    pub index: ::std::os::raw::c_uint,
    #[doc = "< Sector size."]
    pub size: ::std::os::raw::c_uint,
    #[doc = "< Sector starting address."]
    pub address: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bankSector"][::std::mem::size_of::<bankSector>() - 12usize];
    ["Alignment of bankSector"][::std::mem::align_of::<bankSector>() - 4usize];
    ["Offset of field: bankSector::index"][::std::mem::offset_of!(bankSector, index) - 0usize];
    ["Offset of field: bankSector::size"][::std::mem::offset_of!(bankSector, size) - 4usize];
    ["Offset of field: bankSector::address"][::std::mem::offset_of!(bankSector, address) - 8usize];
};
#[doc = " \\struct  deviceBank.\n \\brief   This stucture defines the memory sectors for each bank."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct deviceBank {
    #[doc = "< Number of sectors of the considered bank."]
    pub sectorsNumber: ::std::os::raw::c_uint,
    #[doc = "< Sectors specifications #Bank_Sector."]
    pub sectors: *mut bankSector,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of deviceBank"][::std::mem::size_of::<deviceBank>() - 16usize];
    ["Alignment of deviceBank"][::std::mem::align_of::<deviceBank>() - 8usize];
    ["Offset of field: deviceBank::sectorsNumber"]
        [::std::mem::offset_of!(deviceBank, sectorsNumber) - 0usize];
    ["Offset of field: deviceBank::sectors"][::std::mem::offset_of!(deviceBank, sectors) - 8usize];
};
#[doc = " \\struct  storageStructure.\n \\brief   This stucture describes sotrage characterization."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct storageStructure {
    #[doc = "< Number of exsisted banks."]
    pub banksNumber: ::std::os::raw::c_uint,
    #[doc = "< Banks sectors definition #Device_Bank."]
    pub banks: *mut deviceBank,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of storageStructure"][::std::mem::size_of::<storageStructure>() - 16usize];
    ["Alignment of storageStructure"][::std::mem::align_of::<storageStructure>() - 8usize];
    ["Offset of field: storageStructure::banksNumber"]
        [::std::mem::offset_of!(storageStructure, banksNumber) - 0usize];
    ["Offset of field: storageStructure::banks"]
        [::std::mem::offset_of!(storageStructure, banks) - 8usize];
};
#[doc = " \\struct  bitCoefficient_C.\n \\brief   This stucture indicates the coefficients to access to the adequate option bit."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bitCoefficient_C {
    #[doc = "< Bit multiplier."]
    pub multiplier: ::std::os::raw::c_uint,
    #[doc = "< Bit offset."]
    pub offset: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bitCoefficient_C"][::std::mem::size_of::<bitCoefficient_C>() - 8usize];
    ["Alignment of bitCoefficient_C"][::std::mem::align_of::<bitCoefficient_C>() - 4usize];
    ["Offset of field: bitCoefficient_C::multiplier"]
        [::std::mem::offset_of!(bitCoefficient_C, multiplier) - 0usize];
    ["Offset of field: bitCoefficient_C::offset"]
        [::std::mem::offset_of!(bitCoefficient_C, offset) - 4usize];
};
#[doc = " \\struct  bitValue_C.\n \\brief   This stucture describes the option Bit value."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bitValue_C {
    #[doc = "< Option bit value."]
    pub value: ::std::os::raw::c_uint,
    #[doc = "< Option bit description."]
    pub description: [::std::os::raw::c_char; 1000usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bitValue_C"][::std::mem::size_of::<bitValue_C>() - 1004usize];
    ["Alignment of bitValue_C"][::std::mem::align_of::<bitValue_C>() - 4usize];
    ["Offset of field: bitValue_C::value"][::std::mem::offset_of!(bitValue_C, value) - 0usize];
    ["Offset of field: bitValue_C::description"]
        [::std::mem::offset_of!(bitValue_C, description) - 4usize];
};
#[doc = " \\struct  bit_C.\n \\brief   This stucture will be filled by values which characterize the device's option bytes.\n \\note    See product reference manual for more details."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bit_C {
    #[doc = "< Bit name such as RDP, BOR_LEV, nBOOT0..."]
    pub name: [::std::os::raw::c_char; 64usize],
    #[doc = "< Config description."]
    pub description: [::std::os::raw::c_char; 1000usize],
    #[doc = "< Word offset."]
    pub wordOffset: ::std::os::raw::c_uint,
    #[doc = "< Bit offset."]
    pub bitOffset: ::std::os::raw::c_uint,
    #[doc = "< Number of bits build the option."]
    pub bitWidth: ::std::os::raw::c_uint,
    #[doc = "< Access Read/Write."]
    pub access: ::std::os::raw::c_uchar,
    #[doc = "< Number of possible values."]
    pub valuesNbr: ::std::os::raw::c_uint,
    #[doc = "< Bits value, #BitValue_C."]
    pub values: *mut *mut bitValue_C,
    #[doc = "< Bits equation, #BitCoefficient_C."]
    pub equation: bitCoefficient_C,
    pub reference: *mut ::std::os::raw::c_uchar,
    pub bitValue: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bit_C"][::std::mem::size_of::<bit_C>() - 1120usize];
    ["Alignment of bit_C"][::std::mem::align_of::<bit_C>() - 8usize];
    ["Offset of field: bit_C::name"][::std::mem::offset_of!(bit_C, name) - 0usize];
    ["Offset of field: bit_C::description"][::std::mem::offset_of!(bit_C, description) - 64usize];
    ["Offset of field: bit_C::wordOffset"][::std::mem::offset_of!(bit_C, wordOffset) - 1064usize];
    ["Offset of field: bit_C::bitOffset"][::std::mem::offset_of!(bit_C, bitOffset) - 1068usize];
    ["Offset of field: bit_C::bitWidth"][::std::mem::offset_of!(bit_C, bitWidth) - 1072usize];
    ["Offset of field: bit_C::access"][::std::mem::offset_of!(bit_C, access) - 1076usize];
    ["Offset of field: bit_C::valuesNbr"][::std::mem::offset_of!(bit_C, valuesNbr) - 1080usize];
    ["Offset of field: bit_C::values"][::std::mem::offset_of!(bit_C, values) - 1088usize];
    ["Offset of field: bit_C::equation"][::std::mem::offset_of!(bit_C, equation) - 1096usize];
    ["Offset of field: bit_C::reference"][::std::mem::offset_of!(bit_C, reference) - 1104usize];
    ["Offset of field: bit_C::bitValue"][::std::mem::offset_of!(bit_C, bitValue) - 1112usize];
};
#[doc = " \\struct  category_C\n \\brief   Get option bytes banks categories descriptions."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct category_C {
    #[doc = "< Get category name such as Read Out Protection, BOR Level..."]
    pub name: [::std::os::raw::c_char; 100usize],
    #[doc = "< Get bits number of the considered category."]
    pub bitsNbr: ::std::os::raw::c_uint,
    #[doc = "< Get internal bits descriptions."]
    pub bits: *mut *mut bit_C,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of category_C"][::std::mem::size_of::<category_C>() - 112usize];
    ["Alignment of category_C"][::std::mem::align_of::<category_C>() - 8usize];
    ["Offset of field: category_C::name"][::std::mem::offset_of!(category_C, name) - 0usize];
    ["Offset of field: category_C::bitsNbr"]
        [::std::mem::offset_of!(category_C, bitsNbr) - 100usize];
    ["Offset of field: category_C::bits"][::std::mem::offset_of!(category_C, bits) - 104usize];
};
#[doc = " \\struct  bank_C\n \\brief   Get option bytes banks internal descriptions.\n \\note    STLINK and Bootloader interfaces have different addresses to access to option bytes registres."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bank_C {
    #[doc = "< Bank size."]
    pub size: ::std::os::raw::c_uint,
    #[doc = "< Bank starting address."]
    pub address: ::std::os::raw::c_uint,
    #[doc = "< Bank access Read/Write."]
    pub access: ::std::os::raw::c_uchar,
    #[doc = "< Number of option bytes categories."]
    pub categoriesNbr: ::std::os::raw::c_uint,
    #[doc = "< Get bank categories descriptions #Category_C."]
    pub categories: *mut *mut category_C,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bank_C"][::std::mem::size_of::<bank_C>() - 24usize];
    ["Alignment of bank_C"][::std::mem::align_of::<bank_C>() - 8usize];
    ["Offset of field: bank_C::size"][::std::mem::offset_of!(bank_C, size) - 0usize];
    ["Offset of field: bank_C::address"][::std::mem::offset_of!(bank_C, address) - 4usize];
    ["Offset of field: bank_C::access"][::std::mem::offset_of!(bank_C, access) - 8usize];
    ["Offset of field: bank_C::categoriesNbr"]
        [::std::mem::offset_of!(bank_C, categoriesNbr) - 12usize];
    ["Offset of field: bank_C::categories"][::std::mem::offset_of!(bank_C, categories) - 16usize];
};
#[doc = " \\struct  peripheral_C\n \\brief   Get peripheral option bytes general informations."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct peripheral_C {
    #[doc = "< Peripheral name."]
    pub name: [::std::os::raw::c_char; 64usize],
    #[doc = "< Peripheral description."]
    pub description: [::std::os::raw::c_char; 1000usize],
    #[doc = "< Number of existed banks."]
    pub banksNbr: ::std::os::raw::c_uint,
    #[doc = "< Get banks descriptions #Bank_C."]
    pub banks: *mut *mut bank_C,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of peripheral_C"][::std::mem::size_of::<peripheral_C>() - 1080usize];
    ["Alignment of peripheral_C"][::std::mem::align_of::<peripheral_C>() - 8usize];
    ["Offset of field: peripheral_C::name"][::std::mem::offset_of!(peripheral_C, name) - 0usize];
    ["Offset of field: peripheral_C::description"]
        [::std::mem::offset_of!(peripheral_C, description) - 64usize];
    ["Offset of field: peripheral_C::banksNbr"]
        [::std::mem::offset_of!(peripheral_C, banksNbr) - 1064usize];
    ["Offset of field: peripheral_C::banks"]
        [::std::mem::offset_of!(peripheral_C, banks) - 1072usize];
};
#[doc = " no messages ever printed by the library"]
pub const cubeProgrammerVerbosityLevel_CUBEPROGRAMMER_VER_LEVEL_NONE: cubeProgrammerVerbosityLevel =
    0;
#[doc = " warning, error and success messages are printed (default)"]
pub const cubeProgrammerVerbosityLevel_CUBEPROGRAMMER_VER_LEVEL_ONE: cubeProgrammerVerbosityLevel =
    1;
#[doc = " error roots informational messages are printed"]
pub const cubeProgrammerVerbosityLevel_CUBEPROGRAMMER_VER_LEVEL_TWO: cubeProgrammerVerbosityLevel =
    2;
#[doc = " debug and informational messages are printed"]
pub const cubeProgrammerVerbosityLevel_CUBEPROGRAMMER_VER_LEVEL_DEBUG:
    cubeProgrammerVerbosityLevel = 3;
#[doc = " no progress bar is printed in the output of the library"]
pub const cubeProgrammerVerbosityLevel_CUBEPROGRAMMER_NO_PROGRESS_BAR:
    cubeProgrammerVerbosityLevel = 4;
#[doc = " \\enum  cubeProgrammerVerbosityLevel\n \\brief List of verbosity levels."]
pub type cubeProgrammerVerbosityLevel = ::std::os::raw::c_int;
#[doc = " Success (no error)"]
pub const cubeProgrammerError_CUBEPROGRAMMER_NO_ERROR: cubeProgrammerError = 0;
#[doc = " Device not connected"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_NOT_CONNECTED: cubeProgrammerError = -1;
#[doc = " Device not found"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_NO_DEVICE: cubeProgrammerError = -2;
#[doc = " Device connection error"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_CONNECTION: cubeProgrammerError = -3;
#[doc = " No such file"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_NO_FILE: cubeProgrammerError = -4;
#[doc = " Operation not supported or unimplemented on this interface"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_NOT_SUPPORTED: cubeProgrammerError = -5;
#[doc = " Interface not supported or unimplemented on this plateform"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_INTERFACE_NOT_SUPPORTED: cubeProgrammerError =
    -6;
#[doc = " Insufficient memory"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_NO_MEM: cubeProgrammerError = -7;
#[doc = " Wrong parameters"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_WRONG_PARAM: cubeProgrammerError = -8;
#[doc = " Memory read failure"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_READ_MEM: cubeProgrammerError = -9;
#[doc = " Memory write failure"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_WRITE_MEM: cubeProgrammerError = -10;
#[doc = " Memory erase failure"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_ERASE_MEM: cubeProgrammerError = -11;
#[doc = " File format not supported for this kind of device"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_UNSUPPORTED_FILE_FORMAT: cubeProgrammerError =
    -12;
#[doc = " Refresh required"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_REFRESH_REQUIRED: cubeProgrammerError = -13;
#[doc = " Refresh required"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_NO_SECURITY: cubeProgrammerError = -14;
#[doc = " Changing frequency problem"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_CHANGE_FREQ: cubeProgrammerError = -15;
#[doc = " RDP Enabled error"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_RDP_ENABLED: cubeProgrammerError = -16;
#[doc = " Other error"]
pub const cubeProgrammerError_CUBEPROGRAMMER_ERROR_OTHER: cubeProgrammerError = -99;
#[doc = " \\enum  cubeProgrammerError\n \\brief List of errors that can be occured."]
pub type cubeProgrammerError = ::std::os::raw::c_int;
pub const flashSize_Flash_Size_1KB: flashSize = 1024;
pub const flashSize_Flash_Size_512KB: flashSize = 524288;
pub const flashSize_Flash_Size_256KB: flashSize = 262144;
pub type flashSize = ::std::os::raw::c_int;
pub const wbFunctionArguments_FIRST_INSTALL_ACTIVE: wbFunctionArguments = 1;
pub const wbFunctionArguments_FIRST_INSTALL_NOT_ACTIVE: wbFunctionArguments = 0;
pub const wbFunctionArguments_START_STACK_ACTIVE: wbFunctionArguments = 1;
pub const wbFunctionArguments_START_STACK_NOT_ACTIVE: wbFunctionArguments = 1;
pub const wbFunctionArguments_VERIFY_FILE_DOWLOAD_FILE: wbFunctionArguments = 1;
pub const wbFunctionArguments_DO_NOT_VERIFY_DOWLOAD_FILE: wbFunctionArguments = 0;
pub type wbFunctionArguments = ::std::os::raw::c_int;
#[doc = "< Even parity bit."]
pub const usartParity_EVEN: usartParity = 0;
#[doc = "< Odd parity bit."]
pub const usartParity_ODD: usartParity = 1;
#[doc = "< No check parity."]
pub const usartParity_NONE: usartParity = 2;
#[doc = " \\enum  usartParity\n \\brief The parity bit in the data frame of the USART communication tells the receiving device if there is any error in the data bits."]
pub type usartParity = ::std::os::raw::c_int;
#[doc = "< No flow control."]
pub const usartFlowControl_OFF: usartFlowControl = 0;
#[doc = "< Hardware flow control : RTS/CTS."]
pub const usartFlowControl_HARDWARE: usartFlowControl = 1;
#[doc = "< Software flow control : Transmission is started and stopped by sending special characters."]
pub const usartFlowControl_SOFTWARE: usartFlowControl = 2;
#[doc = " \\enum  usartFlowControl\n \\brief UART Flow Control is a method for devices to communicate with each other over UART without the risk of losing data."]
pub type usartFlowControl = ::std::os::raw::c_int;
#[doc = " \\struct  dfuDeviceInfo\n \\brief   Get DFU device informations ."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dfuDeviceInfo {
    #[doc = "< USB index."]
    pub usbIndex: [::std::os::raw::c_char; 10usize],
    #[doc = "< Bus number."]
    pub busNumber: ::std::os::raw::c_int,
    #[doc = "< Address number."]
    pub addressNumber: ::std::os::raw::c_int,
    #[doc = "< Product number."]
    pub productId: [::std::os::raw::c_char; 100usize],
    #[doc = "< Serial number."]
    pub serialNumber: [::std::os::raw::c_char; 100usize],
    #[doc = "< DFU version."]
    pub dfuVersion: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dfuDeviceInfo"][::std::mem::size_of::<dfuDeviceInfo>() - 224usize];
    ["Alignment of dfuDeviceInfo"][::std::mem::align_of::<dfuDeviceInfo>() - 4usize];
    ["Offset of field: dfuDeviceInfo::usbIndex"]
        [::std::mem::offset_of!(dfuDeviceInfo, usbIndex) - 0usize];
    ["Offset of field: dfuDeviceInfo::busNumber"]
        [::std::mem::offset_of!(dfuDeviceInfo, busNumber) - 12usize];
    ["Offset of field: dfuDeviceInfo::addressNumber"]
        [::std::mem::offset_of!(dfuDeviceInfo, addressNumber) - 16usize];
    ["Offset of field: dfuDeviceInfo::productId"]
        [::std::mem::offset_of!(dfuDeviceInfo, productId) - 20usize];
    ["Offset of field: dfuDeviceInfo::serialNumber"]
        [::std::mem::offset_of!(dfuDeviceInfo, serialNumber) - 120usize];
    ["Offset of field: dfuDeviceInfo::dfuVersion"]
        [::std::mem::offset_of!(dfuDeviceInfo, dfuVersion) - 220usize];
};
#[doc = " \\struct  usartConnectParameters\n \\brief   Specify the USART connect parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usartConnectParameters {
    #[doc = "< Interface identifier: COM1, COM2, /dev/ttyS0..."]
    pub portName: [::std::os::raw::c_char; 100usize],
    #[doc = "< Speed transmission: 115200, 9600..."]
    pub baudrate: ::std::os::raw::c_uint,
    #[doc = "< Parity bit: value in usartParity."]
    pub parity: usartParity,
    #[doc = "< Data bit: value in {6, 7, 8}."]
    pub dataBits: ::std::os::raw::c_uchar,
    #[doc = "< Stop bit: value in {1, 1.5, 2}."]
    pub stopBits: f32,
    #[doc = "< Flow control: value in usartFlowControl."]
    pub flowControl: usartFlowControl,
    #[doc = "< RTS: Value in {0,1}."]
    pub statusRTS: ::std::os::raw::c_int,
    #[doc = "< DTR: Value in {0,1}."]
    pub statusDTR: ::std::os::raw::c_int,
    #[doc = "< Set No Init bits: value in {0,1}."]
    pub noinitBits: ::std::os::raw::c_uchar,
    #[doc = "< request a read unprotect: value in {0,1}."]
    pub rdu: ::std::os::raw::c_char,
    #[doc = "< request a TZEN regression: value in {0,1}."]
    pub tzenreg: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of usartConnectParameters"][::std::mem::size_of::<usartConnectParameters>() - 132usize];
    ["Alignment of usartConnectParameters"]
        [::std::mem::align_of::<usartConnectParameters>() - 4usize];
    ["Offset of field: usartConnectParameters::portName"]
        [::std::mem::offset_of!(usartConnectParameters, portName) - 0usize];
    ["Offset of field: usartConnectParameters::baudrate"]
        [::std::mem::offset_of!(usartConnectParameters, baudrate) - 100usize];
    ["Offset of field: usartConnectParameters::parity"]
        [::std::mem::offset_of!(usartConnectParameters, parity) - 104usize];
    ["Offset of field: usartConnectParameters::dataBits"]
        [::std::mem::offset_of!(usartConnectParameters, dataBits) - 108usize];
    ["Offset of field: usartConnectParameters::stopBits"]
        [::std::mem::offset_of!(usartConnectParameters, stopBits) - 112usize];
    ["Offset of field: usartConnectParameters::flowControl"]
        [::std::mem::offset_of!(usartConnectParameters, flowControl) - 116usize];
    ["Offset of field: usartConnectParameters::statusRTS"]
        [::std::mem::offset_of!(usartConnectParameters, statusRTS) - 120usize];
    ["Offset of field: usartConnectParameters::statusDTR"]
        [::std::mem::offset_of!(usartConnectParameters, statusDTR) - 124usize];
    ["Offset of field: usartConnectParameters::noinitBits"]
        [::std::mem::offset_of!(usartConnectParameters, noinitBits) - 128usize];
    ["Offset of field: usartConnectParameters::rdu"]
        [::std::mem::offset_of!(usartConnectParameters, rdu) - 129usize];
    ["Offset of field: usartConnectParameters::tzenreg"]
        [::std::mem::offset_of!(usartConnectParameters, tzenreg) - 130usize];
};
#[doc = " \\struct  dfuConnectParameters\n \\brief   Specify the USB DFU connect parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dfuConnectParameters {
    pub usb_index: *mut ::std::os::raw::c_char,
    #[doc = "< request a read unprotect: value in {0,1}."]
    pub rdu: ::std::os::raw::c_char,
    #[doc = "< request a TZEN regression: value in {0,1}."]
    pub tzenreg: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dfuConnectParameters"][::std::mem::size_of::<dfuConnectParameters>() - 16usize];
    ["Alignment of dfuConnectParameters"][::std::mem::align_of::<dfuConnectParameters>() - 8usize];
    ["Offset of field: dfuConnectParameters::usb_index"]
        [::std::mem::offset_of!(dfuConnectParameters, usb_index) - 0usize];
    ["Offset of field: dfuConnectParameters::rdu"]
        [::std::mem::offset_of!(dfuConnectParameters, rdu) - 8usize];
    ["Offset of field: dfuConnectParameters::tzenreg"]
        [::std::mem::offset_of!(dfuConnectParameters, tzenreg) - 9usize];
};
#[doc = " \\struct  spiConnectParameters\n \\brief   Specify the SPI connect parameters.\n \\note    Recommended SPI parameters : baudrate=375, crcPol=7, direction=0, cpha=0, cpol=0, crc=0, firstBit=1, frameFormat=0, dataSize=1, mode=1, nss=1, nssPulse=1, delay=1"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spiConnectParameters {
    #[doc = "< Speed transmission 187, 375, 750, 1500, 3000, 6000, 12000 KHz."]
    pub baudrate: u32,
    #[doc = "< crc polynom value."]
    pub crcPol: u16,
    #[doc = "< 2LFullDuplex/2LRxOnly/1LRx/1LTx."]
    pub direction: ::std::os::raw::c_int,
    #[doc = "< 1Edge or 2Edge."]
    pub cpha: ::std::os::raw::c_int,
    #[doc = "< LOW or HIGH."]
    pub cpol: ::std::os::raw::c_int,
    #[doc = "< DISABLE or ENABLE."]
    pub crc: ::std::os::raw::c_int,
    #[doc = "< First bit: LSB or MSB."]
    pub firstBit: ::std::os::raw::c_int,
    #[doc = "< Frame format: Motorola or TI."]
    pub frameFormat: ::std::os::raw::c_int,
    #[doc = "< Size of frame data: 16bit or 8bit ."]
    pub dataSize: ::std::os::raw::c_int,
    #[doc = "< Operating mode: Slave or Master."]
    pub mode: ::std::os::raw::c_int,
    #[doc = "< Selection: Soft or Hard."]
    pub nss: ::std::os::raw::c_int,
    #[doc = "< NSS pulse: No Pulse or Pulse."]
    pub nssPulse: ::std::os::raw::c_int,
    #[doc = "< Delay of few microseconds, No Delay or Delay, at least 4us delay is inserted"]
    pub delay: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of spiConnectParameters"][::std::mem::size_of::<spiConnectParameters>() - 52usize];
    ["Alignment of spiConnectParameters"][::std::mem::align_of::<spiConnectParameters>() - 4usize];
    ["Offset of field: spiConnectParameters::baudrate"]
        [::std::mem::offset_of!(spiConnectParameters, baudrate) - 0usize];
    ["Offset of field: spiConnectParameters::crcPol"]
        [::std::mem::offset_of!(spiConnectParameters, crcPol) - 4usize];
    ["Offset of field: spiConnectParameters::direction"]
        [::std::mem::offset_of!(spiConnectParameters, direction) - 8usize];
    ["Offset of field: spiConnectParameters::cpha"]
        [::std::mem::offset_of!(spiConnectParameters, cpha) - 12usize];
    ["Offset of field: spiConnectParameters::cpol"]
        [::std::mem::offset_of!(spiConnectParameters, cpol) - 16usize];
    ["Offset of field: spiConnectParameters::crc"]
        [::std::mem::offset_of!(spiConnectParameters, crc) - 20usize];
    ["Offset of field: spiConnectParameters::firstBit"]
        [::std::mem::offset_of!(spiConnectParameters, firstBit) - 24usize];
    ["Offset of field: spiConnectParameters::frameFormat"]
        [::std::mem::offset_of!(spiConnectParameters, frameFormat) - 28usize];
    ["Offset of field: spiConnectParameters::dataSize"]
        [::std::mem::offset_of!(spiConnectParameters, dataSize) - 32usize];
    ["Offset of field: spiConnectParameters::mode"]
        [::std::mem::offset_of!(spiConnectParameters, mode) - 36usize];
    ["Offset of field: spiConnectParameters::nss"]
        [::std::mem::offset_of!(spiConnectParameters, nss) - 40usize];
    ["Offset of field: spiConnectParameters::nssPulse"]
        [::std::mem::offset_of!(spiConnectParameters, nssPulse) - 44usize];
    ["Offset of field: spiConnectParameters::delay"]
        [::std::mem::offset_of!(spiConnectParameters, delay) - 48usize];
};
#[doc = " \\struct  canConnectParameters\n \\brief   Specify the CAN connect parameters.\n \\note    Not all configurations are supported by STM32 Bootloader, such as CAN type is STANDARD and the filter should be always activated.\n \\note    Recommended CAN parameters : br=125000, mode=0, ide=0, rtr=0, fifo=0, fm=0, fs=1, fe=1, fbn=0"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct canConnectParameters {
    #[doc = "< Baudrate and speed transmission 125KHz, 250KHz, 500KHz..."]
    pub br: ::std::os::raw::c_int,
    #[doc = "< CAN mode: NORMAL, LOOPBACK...,"]
    pub mode: ::std::os::raw::c_int,
    #[doc = "< CAN type: STANDARD or EXTENDED."]
    pub ide: ::std::os::raw::c_int,
    #[doc = "< Frame format: DATA or REMOTE."]
    pub rtr: ::std::os::raw::c_int,
    #[doc = "< Memory of received messages: FIFO0 or FIFO1."]
    pub fifo: ::std::os::raw::c_int,
    #[doc = "< Filter mode: MASK or LIST."]
    pub fm: ::std::os::raw::c_int,
    #[doc = "< Filter scale: 16 or 32."]
    pub fs: ::std::os::raw::c_int,
    #[doc = "< Filter activation: DISABLE or ENABLE."]
    pub fe: ::std::os::raw::c_int,
    #[doc = "< Filter bank number: 0 to 13."]
    pub fbn: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of canConnectParameters"][::std::mem::size_of::<canConnectParameters>() - 36usize];
    ["Alignment of canConnectParameters"][::std::mem::align_of::<canConnectParameters>() - 4usize];
    ["Offset of field: canConnectParameters::br"]
        [::std::mem::offset_of!(canConnectParameters, br) - 0usize];
    ["Offset of field: canConnectParameters::mode"]
        [::std::mem::offset_of!(canConnectParameters, mode) - 4usize];
    ["Offset of field: canConnectParameters::ide"]
        [::std::mem::offset_of!(canConnectParameters, ide) - 8usize];
    ["Offset of field: canConnectParameters::rtr"]
        [::std::mem::offset_of!(canConnectParameters, rtr) - 12usize];
    ["Offset of field: canConnectParameters::fifo"]
        [::std::mem::offset_of!(canConnectParameters, fifo) - 16usize];
    ["Offset of field: canConnectParameters::fm"]
        [::std::mem::offset_of!(canConnectParameters, fm) - 20usize];
    ["Offset of field: canConnectParameters::fs"]
        [::std::mem::offset_of!(canConnectParameters, fs) - 24usize];
    ["Offset of field: canConnectParameters::fe"]
        [::std::mem::offset_of!(canConnectParameters, fe) - 28usize];
    ["Offset of field: canConnectParameters::fbn"]
        [::std::mem::offset_of!(canConnectParameters, fbn) - 32usize];
};
#[doc = " \\struct  i2cConnectParameters\n \\brief   Specify the I2C connect parameters.\n \\warning The Bootloader Slave address varies depending on the device (see AN2606).\n \\note    Not all configurations are supported by STM32 Bootloader, such as address in 7 bits form, analog filter: ENABLE, digital filter: DISABLE.\n \\note    Recommended I2C parameters : add=0x??, br=400, sm=1, am=0, af=1, df=0, dnf=0, rt=0, ft=0"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct i2cConnectParameters {
    #[doc = "< Device address in hex format."]
    pub add: ::std::os::raw::c_int,
    #[doc = "< Baudrate and speed transmission : 100 or 400 KHz."]
    pub br: ::std::os::raw::c_int,
    #[doc = "< Speed Mode: STANDARD or FAST."]
    pub sm: ::std::os::raw::c_int,
    #[doc = "< Address Mode: 7 or 10 bits."]
    pub am: ::std::os::raw::c_int,
    #[doc = "< Analog filter: DISABLE or ENABLE."]
    pub af: ::std::os::raw::c_int,
    #[doc = "< Digital filter: DISABLE or ENABLE."]
    pub df: ::std::os::raw::c_int,
    #[doc = "< Digital noise filter: 0 to 15."]
    pub dnf: ::std::os::raw::c_char,
    #[doc = "< Rise time: 0-1000 for STANDARD speed mode and  0-300 for FAST."]
    pub rt: ::std::os::raw::c_int,
    #[doc = "< Fall time: 0-300 for STANDARD speed mode and  0-300 for FAST."]
    pub ft: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of i2cConnectParameters"][::std::mem::size_of::<i2cConnectParameters>() - 36usize];
    ["Alignment of i2cConnectParameters"][::std::mem::align_of::<i2cConnectParameters>() - 4usize];
    ["Offset of field: i2cConnectParameters::add"]
        [::std::mem::offset_of!(i2cConnectParameters, add) - 0usize];
    ["Offset of field: i2cConnectParameters::br"]
        [::std::mem::offset_of!(i2cConnectParameters, br) - 4usize];
    ["Offset of field: i2cConnectParameters::sm"]
        [::std::mem::offset_of!(i2cConnectParameters, sm) - 8usize];
    ["Offset of field: i2cConnectParameters::am"]
        [::std::mem::offset_of!(i2cConnectParameters, am) - 12usize];
    ["Offset of field: i2cConnectParameters::af"]
        [::std::mem::offset_of!(i2cConnectParameters, af) - 16usize];
    ["Offset of field: i2cConnectParameters::df"]
        [::std::mem::offset_of!(i2cConnectParameters, df) - 20usize];
    ["Offset of field: i2cConnectParameters::dnf"]
        [::std::mem::offset_of!(i2cConnectParameters, dnf) - 24usize];
    ["Offset of field: i2cConnectParameters::rt"]
        [::std::mem::offset_of!(i2cConnectParameters, rt) - 28usize];
    ["Offset of field: i2cConnectParameters::ft"]
        [::std::mem::offset_of!(i2cConnectParameters, ft) - 32usize];
};
#[doc = "< Apply a reset by the software."]
pub const debugResetMode_SOFTWARE_RESET: debugResetMode = 0;
#[doc = "< Apply a reset by the hardware."]
pub const debugResetMode_HARDWARE_RESET: debugResetMode = 1;
#[doc = "< Apply a reset by the internal core peripheral."]
pub const debugResetMode_CORE_RESET: debugResetMode = 2;
#[doc = " \\enum  debugResetMode\n \\brief Choose the way to apply a system reset."]
pub type debugResetMode = ::std::os::raw::c_int;
#[doc = "< Connect with normal mode, the target is reset then halted while the type of reset is selected using the [debugResetMode]."]
pub const debugConnectMode_NORMAL_MODE: debugConnectMode = 0;
#[doc = "< Connect with hotplug mode,  this option allows the user to connect to the target without halt or reset."]
pub const debugConnectMode_HOTPLUG_MODE: debugConnectMode = 1;
#[doc = "< Connect with under reset mode, option allows the user to connect to the target using a reset vector catch before executing any instruction."]
pub const debugConnectMode_UNDER_RESET_MODE: debugConnectMode = 2;
#[doc = "< Connect with power down mode."]
pub const debugConnectMode_POWER_DOWN_MODE: debugConnectMode = 3;
#[doc = "< Connect with pre reset mode."]
pub const debugConnectMode_PRE_RESET_MODE: debugConnectMode = 4;
#[doc = "< Connect with hwRstPulse mode."]
pub const debugConnectMode_hwRstPulse_MODE: debugConnectMode = 5;
#[doc = " \\enum  debugConnectMode\n \\brief Choose the appropriate mode for connection."]
pub type debugConnectMode = ::std::os::raw::c_int;
#[doc = "< JTAG debug port."]
pub const debugPort_JTAG: debugPort = 0;
#[doc = "< SWD debug port."]
pub const debugPort_SWD: debugPort = 1;
#[doc = " \\enum  debugPort\n \\brief Select the debug port interface for connection."]
pub type debugPort = ::std::os::raw::c_int;
#[doc = " \\struct  frequencies\n \\brief   Get supported frequencies for JTAG and SWD ineterfaces."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct frequencies {
    #[doc = "<  JTAG frequency."]
    pub jtagFreq: [::std::os::raw::c_uint; 12usize],
    #[doc = "<  Get JTAG supported frequencies."]
    pub jtagFreqNumber: ::std::os::raw::c_uint,
    #[doc = "<  SWD frequency."]
    pub swdFreq: [::std::os::raw::c_uint; 12usize],
    #[doc = "<  Get SWD supported frequencies."]
    pub swdFreqNumber: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of frequencies"][::std::mem::size_of::<frequencies>() - 104usize];
    ["Alignment of frequencies"][::std::mem::align_of::<frequencies>() - 4usize];
    ["Offset of field: frequencies::jtagFreq"]
        [::std::mem::offset_of!(frequencies, jtagFreq) - 0usize];
    ["Offset of field: frequencies::jtagFreqNumber"]
        [::std::mem::offset_of!(frequencies, jtagFreqNumber) - 48usize];
    ["Offset of field: frequencies::swdFreq"]
        [::std::mem::offset_of!(frequencies, swdFreq) - 52usize];
    ["Offset of field: frequencies::swdFreqNumber"]
        [::std::mem::offset_of!(frequencies, swdFreqNumber) - 100usize];
};
#[doc = " \\struct  debugConnectParameters\n \\brief   Get device characterization and specify connection parameters through ST-LINK interface."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct debugConnectParameters {
    #[doc = "< Select the type of debug interface #debugPort."]
    pub dbgPort: debugPort,
    #[doc = "< Select one of the debug ports connected."]
    pub index: ::std::os::raw::c_int,
    #[doc = "< ST-LINK serial number."]
    pub serialNumber: [::std::os::raw::c_char; 33usize],
    #[doc = "< Firmware version."]
    pub firmwareVersion: [::std::os::raw::c_char; 20usize],
    #[doc = "< Operate voltage."]
    pub targetVoltage: [::std::os::raw::c_char; 5usize],
    #[doc = "< Number of available access port."]
    pub accessPortNumber: ::std::os::raw::c_int,
    #[doc = "< Select access port controller."]
    pub accessPort: ::std::os::raw::c_int,
    #[doc = "< Select the debug CONNECT mode #debugConnectMode."]
    pub connectionMode: debugConnectMode,
    #[doc = "< Select the debug RESET mode #debugResetMode."]
    pub resetMode: debugResetMode,
    #[doc = "< Check Old ST-LINK firmware version."]
    pub isOldFirmware: ::std::os::raw::c_int,
    #[doc = "< Supported frequencies #frequencies."]
    pub freq: frequencies,
    #[doc = "< Select specific frequency."]
    pub frequency: ::std::os::raw::c_int,
    #[doc = "< Indicates if it's Bridge device or not."]
    pub isBridge: ::std::os::raw::c_int,
    #[doc = "< Select connection type, if it's shared, use ST-LINK Server."]
    pub shared: ::std::os::raw::c_int,
    #[doc = "< board Name"]
    pub board: [::std::os::raw::c_char; 100usize],
    pub DBG_Sleep: ::std::os::raw::c_int,
    #[doc = "< Select speed flashing of Cortex M33 series."]
    pub speed: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of debugConnectParameters"][::std::mem::size_of::<debugConnectParameters>() - 312usize];
    ["Alignment of debugConnectParameters"]
        [::std::mem::align_of::<debugConnectParameters>() - 4usize];
    ["Offset of field: debugConnectParameters::dbgPort"]
        [::std::mem::offset_of!(debugConnectParameters, dbgPort) - 0usize];
    ["Offset of field: debugConnectParameters::index"]
        [::std::mem::offset_of!(debugConnectParameters, index) - 4usize];
    ["Offset of field: debugConnectParameters::serialNumber"]
        [::std::mem::offset_of!(debugConnectParameters, serialNumber) - 8usize];
    ["Offset of field: debugConnectParameters::firmwareVersion"]
        [::std::mem::offset_of!(debugConnectParameters, firmwareVersion) - 41usize];
    ["Offset of field: debugConnectParameters::targetVoltage"]
        [::std::mem::offset_of!(debugConnectParameters, targetVoltage) - 61usize];
    ["Offset of field: debugConnectParameters::accessPortNumber"]
        [::std::mem::offset_of!(debugConnectParameters, accessPortNumber) - 68usize];
    ["Offset of field: debugConnectParameters::accessPort"]
        [::std::mem::offset_of!(debugConnectParameters, accessPort) - 72usize];
    ["Offset of field: debugConnectParameters::connectionMode"]
        [::std::mem::offset_of!(debugConnectParameters, connectionMode) - 76usize];
    ["Offset of field: debugConnectParameters::resetMode"]
        [::std::mem::offset_of!(debugConnectParameters, resetMode) - 80usize];
    ["Offset of field: debugConnectParameters::isOldFirmware"]
        [::std::mem::offset_of!(debugConnectParameters, isOldFirmware) - 84usize];
    ["Offset of field: debugConnectParameters::freq"]
        [::std::mem::offset_of!(debugConnectParameters, freq) - 88usize];
    ["Offset of field: debugConnectParameters::frequency"]
        [::std::mem::offset_of!(debugConnectParameters, frequency) - 192usize];
    ["Offset of field: debugConnectParameters::isBridge"]
        [::std::mem::offset_of!(debugConnectParameters, isBridge) - 196usize];
    ["Offset of field: debugConnectParameters::shared"]
        [::std::mem::offset_of!(debugConnectParameters, shared) - 200usize];
    ["Offset of field: debugConnectParameters::board"]
        [::std::mem::offset_of!(debugConnectParameters, board) - 204usize];
    ["Offset of field: debugConnectParameters::DBG_Sleep"]
        [::std::mem::offset_of!(debugConnectParameters, DBG_Sleep) - 304usize];
    ["Offset of field: debugConnectParameters::speed"]
        [::std::mem::offset_of!(debugConnectParameters, speed) - 308usize];
};
#[doc = "< STLINK used as connection interface."]
pub const targetInterfaceType_STLINK_INTERFACE: targetInterfaceType = 0;
#[doc = "< USART used as connection interface."]
pub const targetInterfaceType_USART_INTERFACE: targetInterfaceType = 1;
#[doc = "< USB DFU used as connection interface."]
pub const targetInterfaceType_USB_INTERFACE: targetInterfaceType = 2;
#[doc = "< SPI used as connection interface."]
pub const targetInterfaceType_SPI_INTERFACE: targetInterfaceType = 3;
#[doc = "< I2C used as connection interface."]
pub const targetInterfaceType_I2C_INTERFACE: targetInterfaceType = 4;
#[doc = "< CAN used as connection interface."]
pub const targetInterfaceType_CAN_INTERFACE: targetInterfaceType = 5;
#[doc = "< JLINK used as connection interface."]
pub const targetInterfaceType_JLINK_INTERFACE: targetInterfaceType = 6;
#[doc = " \\enum  targetInterfaceType\n \\brief Indicates the supported interfaces."]
pub type targetInterfaceType = ::std::os::raw::c_int;
#[doc = " \\struct  displayCallBacks\n \\brief   Functions must be implemented to personalize the display of messages."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct displayCallBacks {
    #[doc = "< Add a progress bar."]
    pub initProgressBar: ::std::option::Option<unsafe extern "C" fn()>,
    #[doc = "< Display internal messages according to verbosity level."]
    pub logMessage: ::std::option::Option<
        unsafe extern "C" fn(msgType: ::std::os::raw::c_int, str_: *const u16),
    >,
    #[doc = "< Display the loading of read/write process."]
    pub loadBar: ::std::option::Option<
        unsafe extern "C" fn(x: ::std::os::raw::c_int, n: ::std::os::raw::c_int),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of displayCallBacks"][::std::mem::size_of::<displayCallBacks>() - 24usize];
    ["Alignment of displayCallBacks"][::std::mem::align_of::<displayCallBacks>() - 8usize];
    ["Offset of field: displayCallBacks::initProgressBar"]
        [::std::mem::offset_of!(displayCallBacks, initProgressBar) - 0usize];
    ["Offset of field: displayCallBacks::logMessage"]
        [::std::mem::offset_of!(displayCallBacks, logMessage) - 8usize];
    ["Offset of field: displayCallBacks::loadBar"]
        [::std::mem::offset_of!(displayCallBacks, loadBar) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct segmentData_C {
    #[doc = "< Segment start address."]
    pub address: ::std::os::raw::c_int,
    #[doc = "< Memory segment size."]
    pub size: ::std::os::raw::c_int,
    #[doc = "< Memory segment data."]
    pub data: *mut ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of segmentData_C"][::std::mem::size_of::<segmentData_C>() - 16usize];
    ["Alignment of segmentData_C"][::std::mem::align_of::<segmentData_C>() - 8usize];
    ["Offset of field: segmentData_C::address"]
        [::std::mem::offset_of!(segmentData_C, address) - 0usize];
    ["Offset of field: segmentData_C::size"][::std::mem::offset_of!(segmentData_C, size) - 4usize];
    ["Offset of field: segmentData_C::data"][::std::mem::offset_of!(segmentData_C, data) - 8usize];
};
#[doc = " \\struct  FileData_C\n \\brief   Get file required informations."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fileData_C {
    #[doc = "< File extension type."]
    pub Type: ::std::os::raw::c_int,
    #[doc = "< Number of required segments."]
    pub segmentsNbr: ::std::os::raw::c_int,
    #[doc = "< Segments description."]
    pub segments: *mut segmentData_C,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fileData_C"][::std::mem::size_of::<fileData_C>() - 16usize];
    ["Alignment of fileData_C"][::std::mem::align_of::<fileData_C>() - 8usize];
    ["Offset of field: fileData_C::Type"][::std::mem::offset_of!(fileData_C, Type) - 0usize];
    ["Offset of field: fileData_C::segmentsNbr"]
        [::std::mem::offset_of!(fileData_C, segmentsNbr) - 4usize];
    ["Offset of field: fileData_C::segments"]
        [::std::mem::offset_of!(fileData_C, segments) - 8usize];
};
#[doc = " \\struct  GeneralInf\n \\brief   Get device general informations."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct generalInf {
    #[doc = "< Device ID."]
    pub deviceId: ::std::os::raw::c_ushort,
    #[doc = "< Flash memory size."]
    pub flashSize: ::std::os::raw::c_int,
    #[doc = "< Bootloader version"]
    pub bootloaderVersion: ::std::os::raw::c_int,
    #[doc = "< Device MCU or MPU."]
    pub type_: [::std::os::raw::c_char; 4usize],
    #[doc = "< Cortex CPU."]
    pub cpu: [::std::os::raw::c_char; 20usize],
    #[doc = "< Device name."]
    pub name: [::std::os::raw::c_char; 100usize],
    #[doc = "< Device serie."]
    pub series: [::std::os::raw::c_char; 100usize],
    #[doc = "< Take notice."]
    pub description: [::std::os::raw::c_char; 150usize],
    #[doc = "< Revision ID."]
    pub revisionId: [::std::os::raw::c_char; 8usize],
    #[doc = "< Board Rpn."]
    pub board: [::std::os::raw::c_char; 100usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of generalInf"][::std::mem::size_of::<generalInf>() - 496usize];
    ["Alignment of generalInf"][::std::mem::align_of::<generalInf>() - 4usize];
    ["Offset of field: generalInf::deviceId"]
        [::std::mem::offset_of!(generalInf, deviceId) - 0usize];
    ["Offset of field: generalInf::flashSize"]
        [::std::mem::offset_of!(generalInf, flashSize) - 4usize];
    ["Offset of field: generalInf::bootloaderVersion"]
        [::std::mem::offset_of!(generalInf, bootloaderVersion) - 8usize];
    ["Offset of field: generalInf::type_"][::std::mem::offset_of!(generalInf, type_) - 12usize];
    ["Offset of field: generalInf::cpu"][::std::mem::offset_of!(generalInf, cpu) - 16usize];
    ["Offset of field: generalInf::name"][::std::mem::offset_of!(generalInf, name) - 36usize];
    ["Offset of field: generalInf::series"][::std::mem::offset_of!(generalInf, series) - 136usize];
    ["Offset of field: generalInf::description"]
        [::std::mem::offset_of!(generalInf, description) - 236usize];
    ["Offset of field: generalInf::revisionId"]
        [::std::mem::offset_of!(generalInf, revisionId) - 386usize];
    ["Offset of field: generalInf::board"][::std::mem::offset_of!(generalInf, board) - 394usize];
};
#[doc = " \\struct  deviceSector\n \\brief   Get device sectors basic informations."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct deviceSector {
    #[doc = "< Number of Sectors."]
    pub sectorNum: u32,
    #[doc = "< Sector Size in BYTEs."]
    pub sectorSize: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of deviceSector"][::std::mem::size_of::<deviceSector>() - 8usize];
    ["Alignment of deviceSector"][::std::mem::align_of::<deviceSector>() - 4usize];
    ["Offset of field: deviceSector::sectorNum"]
        [::std::mem::offset_of!(deviceSector, sectorNum) - 0usize];
    ["Offset of field: deviceSector::sectorSize"]
        [::std::mem::offset_of!(deviceSector, sectorSize) - 4usize];
};
#[doc = " \\struct  externalLoader\n \\brief   Get external Loader parameters to launch the process of programming an external flash memory."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct externalLoader {
    #[doc = "< FlashLoader file path."]
    pub filePath: [::std::os::raw::c_char; 200usize],
    #[doc = "< Device Name and Description."]
    pub deviceName: [::std::os::raw::c_char; 100usize],
    #[doc = "< Device Type: ONCHIP, EXT8BIT, EXT16BIT, ..."]
    pub deviceType: ::std::os::raw::c_int,
    #[doc = "< Default Device Start Address."]
    pub deviceStartAddress: u32,
    #[doc = "< Total Size of Device."]
    pub deviceSize: u32,
    #[doc = "< Programming Page Size."]
    pub pageSize: u32,
    #[doc = "< Type number."]
    pub sectorsTypeNbr: u32,
    #[doc = "< Device sectors."]
    pub sectors: *mut deviceSector,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of externalLoader"][::std::mem::size_of::<externalLoader>() - 328usize];
    ["Alignment of externalLoader"][::std::mem::align_of::<externalLoader>() - 8usize];
    ["Offset of field: externalLoader::filePath"]
        [::std::mem::offset_of!(externalLoader, filePath) - 0usize];
    ["Offset of field: externalLoader::deviceName"]
        [::std::mem::offset_of!(externalLoader, deviceName) - 200usize];
    ["Offset of field: externalLoader::deviceType"]
        [::std::mem::offset_of!(externalLoader, deviceType) - 300usize];
    ["Offset of field: externalLoader::deviceStartAddress"]
        [::std::mem::offset_of!(externalLoader, deviceStartAddress) - 304usize];
    ["Offset of field: externalLoader::deviceSize"]
        [::std::mem::offset_of!(externalLoader, deviceSize) - 308usize];
    ["Offset of field: externalLoader::pageSize"]
        [::std::mem::offset_of!(externalLoader, pageSize) - 312usize];
    ["Offset of field: externalLoader::sectorsTypeNbr"]
        [::std::mem::offset_of!(externalLoader, sectorsTypeNbr) - 316usize];
    ["Offset of field: externalLoader::sectors"]
        [::std::mem::offset_of!(externalLoader, sectors) - 320usize];
};
#[doc = " \\struct  externalStorageInfo\n \\brief   Get external storage informations useful for external Loader."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct externalStorageInfo {
    pub externalLoaderNbr: ::std::os::raw::c_uint,
    pub externalLoader: *mut externalLoader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of externalStorageInfo"][::std::mem::size_of::<externalStorageInfo>() - 16usize];
    ["Alignment of externalStorageInfo"][::std::mem::align_of::<externalStorageInfo>() - 8usize];
    ["Offset of field: externalStorageInfo::externalLoaderNbr"]
        [::std::mem::offset_of!(externalStorageInfo, externalLoaderNbr) - 0usize];
    ["Offset of field: externalStorageInfo::externalLoader"]
        [::std::mem::offset_of!(externalStorageInfo, externalLoader) - 8usize];
};
pub struct CubeProgrammer_API {
    __library: ::libloading::Library,
    pub __va_start: Result<unsafe extern "C" fn(arg1: *mut va_list, ...), ::libloading::Error>,
    pub __security_init_cookie: Result<unsafe extern "C" fn(), ::libloading::Error>,
    pub __security_check_cookie:
        Result<unsafe extern "C" fn(_StackCookie: usize), ::libloading::Error>,
    pub __report_gsfailure:
        Result<unsafe extern "C" fn(_StackCookie: usize) -> !, ::libloading::Error>,
    pub __security_cookie: Result<*mut usize, ::libloading::Error>,
    pub getStLinkList: Result<
        unsafe extern "C" fn(
            stLinkList: *mut *mut debugConnectParameters,
            shared: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
        ::libloading::Error,
    >,
    pub getStLinkEnumerationList: Result<
